rails/cris-and-ry/app/controllers/hosts_controller.rb

SELECT "hosts".* FROM "hosts"
---
    def index
        render json: Host.all

SELECT "hosts".* FROM "hosts" WHERE "hosts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        host = Host.find_by!(id: params[:id])

INSERT INTO "hosts" ("username", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "hostTwo"], ["email", "host2@email.com"], ["password", "[FILTERED]"], ["created_at", "2023-01-23 16:18:13.889401"], ["updated_at", "2023-01-23 16:18:13.889401"]]
---
        def create
        host = Host.create!(username: params[:username], email: params[:email], password: params[:password])

SELECT "hosts".* FROM "hosts" WHERE "hosts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "hosts" WHERE "hosts"."id" = ?  [["id", 2]]
---
    def destroy
        host = Host.find_by!(id: params[:id])
        host.delete