rails/cris-and-ry/app/controllers/users_controller.rb

    def show
        user = User.find_by!(id: params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def create
        user = User.create!(username: params[:username], first_name: params[:first_name], last_name: params[:last_name])
---
INSERT INTO "users" ("username", "first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "userTwo"], ["first_name", "Tea"], ["last_name", "Chamomile"], ["created_at", "2023-01-23 16:23:23.543707"], ["updated_at", "2023-01-23 16:23:23.543707"]]

    def destroy
        user = User.find_by!(id: params[:id])
        user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]